In [11]:
import pandas as pd
import numpy as np
data = {'Name':['Alice','Bob','Caro','David'],'Age':[19,21,20,22],'Midterm_1':[100,85,90,77],'Midterm_2':[80,99,85,75]}
df = pd.DataFrame(data,index=[1,2,3,4],columns=['Name','Age','Midterm_1','Midterm_2'])
df['Average'] = (df['Midterm_1'] + df['Midterm_2'])/2
df['Major'] = ['IT',np.nan,'Mathematics','IT']
df
df.index = df.Name
del df['Name']
df

       Age  Midterm_1  Midterm_2  Average        Major
Name
Alice   19        100         80     90.0           IT
Bob     21         85         99     92.0          NaN
Caro    20         90         85     87.5  Mathematics
David   22         77         75     76.0           IT

In [30]:
df2 = pd.DataFrame(np.random.randn(5,5))
print(df2,end='\n\n')

print("The sum of all the positive values:",df2[df2 > 0].fillna(0).values.sum())
print("The sum of all the negative values:",df2[df2 < 0].fillna(0).values.sum(),end='\n\n')
print("Rows that meet the requirement:")
print(df2[(np.abs(df2) > 1.8).any(1)])

print("After dropping the 3rd row:")
print(df2.drop(2))
print("After dropping the 2nd column:")
print(df2.drop(1,axis=1))

          0         1         2         3         4
0 -0.551642 -0.917440  2.192903 -1.403199  0.819914
1 -1.317458  0.372976 -0.037259  1.046262  1.831721
2 -0.210886  0.869276  1.851818  1.465877  0.642305
3 -1.132067  0.157274 -0.793022 -0.088709  0.323303
4 -0.557636 -0.340715 -0.204136  0.749714  1.260035

The sum of all the positive values: 13.583378195698685
The sum of all the negative values: -7.5541695948812695

Rows that meet the requirement:
          0         1         2         3         4
0 -0.551642 -0.917440  2.192903 -1.403199  0.819914
1 -1.317458  0.372976 -0.037259  1.046262  1.831721
2 -0.210886  0.869276  1.851818  1.465877  0.642305
After dropping the 3rd row:
          0         1         2         3         4
0 -0.551642 -0.917440  2.192903 -1.403199  0.819914
1 -1.317458  0.372976 -0.037259  1.046262  1.831721
3 -1.132067  0.157274 -0.793022 -0.088709  0.323303
4 -0.557636 -0.340715 -0.204136  0.749714  1.260035
After dropping the 2nd column:
          0         2         3         4
0 -0.551642  2.192903 -1.403199  0.819914
1 -1.317458 -0.037259  1.046262  1.831721
2 -0.210886  1.851818  1.465877  0.642305
3 -1.132067 -0.793022 -0.088709  0.323303
4 -0.557636 -0.204136  0.749714  1.260035